#include<iostream>
#include<vector>
using namespace std;

#define MAX_N 100000

int n,m;//n เปรีียบเสมือน สมาชิกทั้งหมดในกลุ่ม และ m คือจำนวนความสัมพันธ์ในกลุ่มโดยเข้าใจได้ว่า คนจำนวน n ไม่จำเป็นต้องรู้จักกันหมด

vector<int> adj[MAX_N];//เปรียบเสมือนการหาเพื่อนร่วมกันในสมาชิกของคนนั้นเช่นถ้าหา array กล้า ก็จะได้สมาชืกที่เป็นเพื่อนคือ โมส น้ำ ฟิน เตอร์ ทิกเกอร์...

int deg[MAX_N];//เปรียบเสมือนจำนวนสมาชิกที่รู้จัก เช่น deg[กล้า] = 5 เพราะกล้ามีจำนวนความสัมพันธ์ 5 คน

void    init(){//เป็นการ reset จำนวนรายชื่อเพื่อน 

    for (int i = 0; i < n; i++)//โดยเราจะรู้สมาชิกของคนกลุ่มนึงจาก n ถ้า n = 5 เราจะรู้ได้เลยว่า มีสมาชืก 5 คน
    {
        deg[i] = 0;// i จะเริ่มเดินแทนจำนวนในสมาชิก เช่น deg[กล้า] = 0 แสดงว่ากล้านั้นไม่มีเพื่อนเลย
    }
    
}

void readinput(){

    int u,v;//ในกรณีนี้เราจะสมมุติว่า u เป็นคน และ v เป็นคน

    cout << "Input undigraph\n";
    cin >> n >> m;//รับค่าของจำนวนสมาชิก n และ จำนวนความสัมพันธ์ m

    init();

    for (int i = 0; i < m; i++)//พอเรารู้ว่า มีจำนวนความสัมพันธ์
    {
        cin >> u >> v;//รับค่าของคนสองคน
        u--;//ตามหลักของ array ต้องเริ่มจาก 0 เลยต้องลดค่าไปอย่างละ 1 เสมอ
        v--;//ตามหลักของ array ต้องเริ่มจาก 0 เลยต้องลดค่าไปอย่างละ 1 เสมอ
        adj[u].push_back(v);//ให้ u รู้จัก v
        deg[u]++;//เพิ่มจำนวนเพื่อน
        adj[v].push_back(u);//ให้ v รู้จัก u
        deg[v]++;//เพิ่มจำนวนเพื่อน
    }
    

}

void show(){

    for (int i = 0; i < n; i++)
    {
        cout << i + 1 << " : ";

        for (int j = 0; j < deg[i]; j++)
        {
            cout << adj[i][j] + 1;
        }

        cout << endl;
        
    }
    
}

int main(){

    readinput();
    cout << "output" << endl;
    show();
    return 0;
}