#include<iostream>
#include<vector>
#include<list>
using namespace std;

#define MAX_N 100000

int n,m;
vector<int> adj[MAX_N];
int deg[MAX_N];
bool visit[MAX_N];
int layer[MAX_N];
int pred[MAX_N];

list<int> Q;

void init(){

    for (int i = 0; i < n; i++)
    {
        deg[i] = 0;
        visit[i] = false;
        layer[i] = -1;
        pred[i] = -1;
    }   
}

void readinput(){

    int u,v;
    cout << "Input\n";
    cin >> n >> m;

    for (int i = 0; i < 0; i++)
    {
        cin >> u >> v;
        u--;
        v--;
        adj[u].push_back(v);
        deg[u]++;
        adj[v].push_back(u);
        deg[v]++;
    }
    
}

void show(){

    for (int i = 0; i < n; i++)
    {
        cout << i + 1 << " : ";

        for (int j = 0; j < deg[i]; j++)
        {
            cout << adj[i][j] << " ";
        }

        cout << endl;
        
    }
    
}

void bfs(int s){//เริ่มเกมส่งข่าว! โดยให้เด็กที่ชื่อ s เป็นคนแรกที่รู้ข่าว

    int u = s;//ตั้งชื่อเล่นชั่วคราวให้เด็กคนแรกว่า u
    visit[s] = true;//เอาปากกาติ๊กถูกลงในสมุดว่า "เด็กชื่อ s ได้รับข่าวแล้วนะ!"
    layer[s] = 0;//บันทึกว่า s คือคนต้นเรื่อง ข่าวจึงถูกส่งต่อมา 0 ทอด (0 ก้าว)
    pred[s] = 0;//บันทึกไว้ว่าไม่มีใครมาบอกข่าว s (เริ่มจากตัวเอง)
    Q.push_back(s);//จับเด็กที่ชื่อ s ไปยืนรอเป็นคนแรกใน "แถวรอคิว" เพื่อเตรียมตัวไปบอกเพื่อนคนอื่น

    while (!Q.empty())//ทำงานต่อไปเรื่อยๆ ตราบใดที่ "แถวรอคิวยังมีคนอยู่"
    {
        
        int u = Q.front();//เรียกเด็กที่ยืนอยู่ "หน้าสุดของแถว" ออกมา สมมติให้ชื่อ u
        Q.pop_front();//ให้เด็กคนนั้นเดินออกจากแถวไป (เพราะกำลังจะไปทำหน้าที่บอกข่าวเพื่อนแล้ว)

        for (int d = 0; d < deg[u]; d++)//ให้ u กางสมุดรายชื่อเพื่อนของตัวเองออกมา แล้วเดินไปหาเพื่อนทีละคนจนครบ
        {
            int v = adj[u][d];//ตั้งชื่อเรียกเพื่อนที่กำลังยืนคุยด้วยตอนนี้ว่า v
            if (visit[v] == false)//เช็คสิว่าเพื่อนชื่อ v คนนี้ "ยังไม่รู้ข่าว" ใช่ไหม?
            {
                visit[v] = true;//ถ้าเขายังไม่รู้ข่าว ก็บอกข่าวเขา แล้วเอาปากกาติ๊กถูกว่า "ตอนนี้ v รู้ข่าวแล้วนะ!"
                pred[v] = u;//จดบันทึกไว้ว่า คนที่วิ่งเอาข่าวมาบอก v ก็คือ u นี่แหละ
                layer[v] = layer[u] + 1;//บันทึกว่าข่าวเดินทางมาถึง v โดยบวกระยะทางเพิ่มไปอีก 1 ทอด
                Q.push_back(v);//จับเพื่อนที่ชื่อ v ไปต่อท้ายแถวรอคิว เพื่อที่รอบต่อไปเขาจะได้ไปบอกข่าวเพื่อนของเขาต่อ

            }
            
        }
        
    }

    for (int i = 0; i < n; i++)
    {
        cout<< i+1 << ", " << layer[i] << endl;
    }
    
    

}